#include <stdio.h>

int main()
{
    // 数据类型为：int[10]
   int a[10];
    // 数据类型为：int[5][10]
   int b[5][10] = {
    {0, 1, 2, 3, 4, 5, 6, 7, 8, 9},
    {10, 11, 12, 13, 14, 15, 16, 17, 18, 19},
    {20, 21, 22, 23, 24, 25, 26, 27, 28, 29},
    {30, 31, 32, 33, 34, 35, 36, 37, 38, 39},
    {40, 41, 42, 43, 44, 45, 46, 47, 48, 49}
   };

   printf("sizeof a =%d\n", sizeof(a));
   printf("sizeof b =%d\n", sizeof(b));

    // 定义普通的指针
    int *pa = a;

    // 定义数组指针. pb 的类型为: int(*)[10] 的指针
    int (*pb)[10] = b;

    printf("pb = %d\n",**pb);
    printf("pb + 1 = %d\n",**(pb + 1));

   return 0;
}


